src/cfe/package-manager/InformationRegisters/пм_УстановленныеПакеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>пм_УстановленныеПакеты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяРасширения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступнаяВерсия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автообновление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пакет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пм_ИсточникиПакетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/package-manager/CommonModules/пм_МенеджерПакетов/Ext/Module.bsl
#Если Сервер Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устанавливает файл пакета подходящим установщиком.
// Установщик выбирается по типу файла: строковая диспетчеризация через
// Выполнить заменена явным выбором, поэтому имя обработчика из манифеста
// каталога больше не используется.
//
// Параметры:
//  ДвоичныеДанные - ДвоичныеДанные - Содержимое файла пакета.
//  ИмяФайла - Строка - Имя файла с расширением.
//
// Возвращаемое значение:
//  Структура - Результат установки:
// * Успешно - Булево
// * ТекстОшибки - Строка
// * ТребуетсяПерезапуск - Булево
// * АдресВоВременномХранилище - Строка - Заполняется для внешних файлов
// * ИмяФормы - Строка - Заполняется для внешних файлов
// * Замечания - Строка - Замечания платформы, установку не отменяют
//
Функция УстановитьФайлПакета(ДвоичныеДанные, ИмяФайла) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("ТребуетсяПерезапуск", Ложь);
	Результат.Вставить("АдресВоВременномХранилище", "");
	Результат.Вставить("ИмяФормы", "");
	Результат.Вставить("Замечания", "");

	ТипФайла = ТипФайлаПакета(ИмяФайла);

	Если ТипФайла = ТипФайлаРасширение() Тогда

		РезультатУстановки = пм_УстановщикРасширений.УстановитьИзДвоичныхДанных(ДвоичныеДанные);
		ЗаполнитьЗначенияСвойств(Результат, РезультатУстановки);

	ИначеЕсли ТипФайла = ТипФайлаОбработка() Или ТипФайла = ТипФайлаОтчет() Тогда

		// Без безопасного режима, как и расширения: пакет пришел из своего
		// реестра, а в безопасном режиме обработке недоступны файлы и COM.
		РезультатПодготовки = пм_УстановщикВнешнихФайлов.ПодготовитьВнешнийФайл(
			ДвоичныеДанные, ИмяФайла, Ложь);
		ЗаполнитьЗначенияСвойств(Результат, РезультатПодготовки);

	Иначе

		Результат.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Файл %1 не поддерживается: установить можно .cfe, .epf и .erf.'"),
			ИмяФайла);

	КонецЕсли;

	Возврат Результат;

КонецФункции

// Возвращает тип файла пакета по его имени.
//
// Параметры:
//  ИмяФайла - Строка - Имя файла с расширением.
//
// Возвращаемое значение:
//  Строка - cfe, epf, erf либо пустая строка.
//
Функция ТипФайлаПакета(Знач ИмяФайла) Экспорт

	ИмяФайла = НРег(СокрЛП(ИмяФайла));

	Для Каждого Тип Из ПоддерживаемыеТипыФайлов() Цикл
		Если СтрЗаканчиваетсяНа(ИмяФайла, "." + Тип) Тогда
			Возврат Тип;
		КонецЕсли;
	КонецЦикла;

	Возврат "";

КонецФункции

// Возвращает Истина, если это расширение - сам менеджер пакетов.
// Сравнивается имя расширения из файла, а не имя файла: имя файла
// пользователь может задать любым, а имя расширения определяет платформа.
//
// Параметры:
//  ИмяРасширения - Строка - См. ИмяРасширенияИзФайла
//
// Возвращаемое значение:
//  Булево - Истина, если менеджер пакетов обновляет сам себя.
//
Функция ЭтоРасширениеМенеджера(Знач ИмяРасширения) Экспорт

	Возврат ЗначениеЗаполнено(ИмяРасширения)
		И ИмяРасширения = пм_МенеджерПакетовКлиентСервер.ИмяРасширенияМенеджера();

КонецФункции

// Имя расширения внутри файла .cfe.
//
// Имя пакета в реестре с именем расширения не совпадает: GitLab требует
// ASCII, и пайплайн транслитерирует имя. Настоящее имя знает только файл,
// поэтому оно читается до установки и запоминается в регистре.
//
// Параметры:
//  ДвоичныеДанные - ДвоичныеДанные - Содержимое файла .cfe.
//  ИмяФайла - Строка - Имя файла с расширением.
//
// Возвращаемое значение:
//  Строка - Имя расширения, пустая строка для не-расширения и битого файла.
//
Функция ИмяРасширенияИзФайла(ДвоичныеДанные, ИмяФайла) Экспорт

	Если ТипФайлаПакета(ИмяФайла) <> ТипФайлаРасширение() Тогда
		Возврат "";
	КонецЕсли;

	Попытка
		ОписаниеРасширения = Новый ОписаниеКонфигурации(ДвоичныеДанные);
	Исключение
		// Разбирать файл здесь не наша задача: если он битый,
		// об этом сообщит установщик расширений.
		Возврат "";
	КонецПопытки;

	Возврат ОписаниеРасширения.Имя;

КонецФункции

// Расширение информационной базы, соответствующее пакету.
//
// Пакет ищется сначала по имени расширения, потом по транслитерации:
// в реестре пакет мог получить латинское имя от кириллического расширения.
//
// Параметры:
//  ИмяПакета - Строка - Имя package.
//  РасширенияБазы - Соответствие - См. РасширенияИнформационнойБазы.
//                   Передается, когда пакетов много: список базы читается один раз.
//
// Возвращаемое значение:
//  Структура - Сведения о расширении:
// * Имя - Строка
// * Версия - Строка
// * Неоднозначное - Булево - Имени пакета отвечает больше одного расширения
//  Неопределено - Расширения с таким именем в базе нет.
//
Функция РасширениеПакета(Знач ИмяПакета, РасширенияБазы = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(ИмяПакета) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если РасширенияБазы = Неопределено Тогда
		РасширенияБазы = РасширенияИнформационнойБазы();
	КонецЕсли;

	Возврат РасширенияБазы.Получить(НРег(СокрЛП(ИмяПакета)));

КонецФункции

// Расширения информационной базы, разложенные по именам, под которыми
// их можно встретить в реестре пакетов: собственное имя и транслитерация.
//
// Возвращаемое значение:
//  Соответствие - Ключ строка в нижнем регистре, значение См. РасширениеПакета
//
Функция РасширенияИнформационнойБазы() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Расширения = РасширенияКонфигурации.Получить();
	Результат = Новый Соответствие;

	// Собственные имена идут первыми: они точные и вытесняют транслитерацию.
	Для Каждого Расширение Из Расширения Цикл
		Результат.Вставить(НРег(Расширение.Имя), СведенияОРасширении(Расширение));
	КонецЦикла;

	Для Каждого Расширение Из Расширения Цикл

		Ключ = НРег(пм_МенеджерПакетовКлиентСервер.ИмяПакетаПоИмениРасширения(Расширение.Имя));
		Если Не ЗначениеЗаполнено(Ключ) Тогда
			Продолжить;
		КонецЕсли;

		Сведения = Результат.Получить(Ключ);
		Если Сведения = Неопределено Тогда
			Результат.Вставить(Ключ, СведенияОРасширении(Расширение));
		ИначеЕсли Сведения.Имя <> Расширение.Имя Тогда
			// Два расширения дают одно имя пакета: версию отсюда брать нельзя.
			Сведения.Неоднозначное = Истина;
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Выбирает файл версии пакета из списка, который вернул провайдер.
// Сопроводительные файлы вроде .srcsha не считаются. Без имени
// однозначен только единственный устанавливаемый файл.
//
// Параметры:
//  Файлы - Массив - Соответствия с ключом file_name.
//  ИмяФайла - Строка - Ожидаемое имя файла, может быть пустым.
//
// Возвращаемое значение:
//  Соответствие, Неопределено - Описание файла либо Неопределено.
//
Функция ВыбратьФайлВерсии(Файлы, Знач ИмяФайла = "") Экспорт

	Если Файлы = Неопределено Или Файлы.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	Устанавливаемые = Новый Массив;
	Для Каждого Файл Из Файлы Цикл
		Если ЗначениеЗаполнено(ТипФайлаПакета(Строка(Файл.Получить("file_name")))) Тогда
			Устанавливаемые.Добавить(Файл);
		КонецЕсли;
	КонецЦикла;

	Если ЗначениеЗаполнено(ИмяФайла) Тогда

		Для Каждого Файл Из Устанавливаемые Цикл
			Если СтрСравнить(Строка(Файл.Получить("file_name")), ИмяФайла) = 0 Тогда
				Возврат Файл;
			КонецЕсли;
		КонецЦикла;

		Для Каждого Файл Из Устанавливаемые Цикл
			Если СтрСравнить(ИмяПакетаИзИмениФайла(Файл.Получить("file_name")), ИмяФайла) = 0 Тогда
				Возврат Файл;
			КонецЕсли;
		КонецЦикла;

		Возврат Неопределено;

	КонецЕсли;

	Если Устанавливаемые.Количество() <> 1 Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Устанавливаемые[0];

КонецФункции

// Имя package из имени файла: solution.cfe -> solution.
// Неподдерживаемое расширение дает пустую строку.
//
// Параметры:
//  ИмяФайла - Строка - Имя файла с расширением.
//
// Возвращаемое значение:
//  Строка - Имя пакета либо пустая строка.
//
Функция ИмяПакетаИзИмениФайла(Знач ИмяФайла) Экспорт

	ИмяФайла = СокрЛП(Строка(ИмяФайла));
	ТипФайла = ТипФайлаПакета(ИмяФайла);
	Если Не ЗначениеЗаполнено(ТипФайла) Тогда
		Возврат "";
	КонецЕсли;

	Возврат Лев(ИмяФайла, СтрДлина(ИмяФайла) - СтрДлина(ТипФайла) - 1);

КонецФункции

Функция ТипФайлаРасширение() Экспорт
	Возврат "cfe";
КонецФункции

Функция ТипФайлаОбработка() Экспорт
	Возврат "epf";
КонецФункции

Функция ТипФайлаОтчет() Экспорт
	Возврат "erf";
КонецФункции

// Типы файлов, которые менеджер умеет устанавливать.
Функция ПоддерживаемыеТипыФайлов() Экспорт

	Типы = Новый Массив;
	Типы.Добавить(ТипФайлаРасширение());
	Типы.Добавить(ТипФайлаОбработка());
	Типы.Добавить(ТипФайлаОтчет());

	Возврат Типы;

КонецФункции

// Сверяет регистр установленных пакетов с расширениями информационной базы:
// расширение сняли вручную - запись о пакете снимается. Вызывается при старте.
//
// Пакеты .epf и .erf не сверяются: менеджер их в базу не устанавливает,
// а открывает из временного хранилища, поэтому проверять нечего.
//
// Возвращаемое значение:
//  Число - Сколько записей снято.
//
Функция СверитьУстановленныеПакеты() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Сведения = РегистрыСведений.пм_УстановленныеПакеты.ВерсииПакетов();
	Если Сведения.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;

	РасширенияБазы = РасширенияИнформационнойБазы();

	Удалено = 0;
	Для Каждого Строка Из Сведения Цикл

		Если Не ЗначениеЗаполнено(Строка.Пакет) Тогда
			Продолжить;
		КонецЕсли;

		Если ПакетЕстьВСпискеРасширений(
			Строка.Пакет, Строка.ИмяФайла, Строка.ИмяРасширения, РасширенияБазы) Тогда
			Продолжить;
		КонецЕсли;

		Если РегистрыСведений.пм_УстановленныеПакеты.УдалитьСведения(Строка.Источник, Строка.Пакет) Тогда
			Удалено = Удалено + 1;
		КонецЕсли;

	КонецЦикла;

	Если Удалено > 0 Тогда
		ЗаписьЖурналаРегистрации(
			ИмяСобытияСверки(),
			УровеньЖурналаРегистрации.Информация,
			,
			,
			СтрШаблон(
				НСтр("ru = 'Расширений удалено из базы, сведения о пакетах сняты: %1.'"),
				Удалено));
	КонецЕсли;

	Возврат Удалено;

КонецФункции

// Пакет по-прежнему установлен в информационной базе.
// Для .epf и .erf всегда Истина: в базу они не устанавливаются.
//
// Параметры:
//  ИмяПакета - Строка - Имя package.
//  ИмяФайла - Строка - Имя файла пакета, по нему определяется тип.
//  ИмяРасширения - Строка - Имя расширения в базе, если оно известно.
//                  Пустое имя - пакет ищется по своему имени и транслитерации.
//
// Возвращаемое значение:
//  Булево
//
Функция ПакетПрисутствуетВИнформационнойБазе(ИмяПакета, ИмяФайла, ИмяРасширения = "") Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Возврат ПакетЕстьВСпискеРасширений(
		ИмяПакета, ИмяФайла, ИмяРасширения, РасширенияИнформационнойБазы());

КонецФункции

// Имя события журнала регистрации для сверки установленных пакетов.
Функция ИмяСобытияСверки() Экспорт

	Возврат НСтр("ru = 'Менеджер пакетов.Сверка установленных'");

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Известно имя расширения - ищем строго по нему: имя пакета в реестре
// от имени расширения отличается, и по нему запись снималась бы зря.
// Имя неизвестно и тип файла не расширение - запись не трогаем: снимаем
// только то, про что точно знаем, что это расширение.
Функция ПакетЕстьВСпискеРасширений(ИмяПакета, ИмяФайла, ИмяРасширения, РасширенияБазы)

	Если ЗначениеЗаполнено(ИмяРасширения) Тогда
		Возврат РасширенияБазы.Получить(НРег(СокрЛП(Строка(ИмяРасширения)))) <> Неопределено;
	КонецЕсли;

	Если ТипФайлаПакета(ИмяФайла) <> ТипФайлаРасширение() Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат РасширенияБазы.Получить(НРег(СокрЛП(Строка(ИмяПакета)))) <> Неопределено;

КонецФункции

Функция СведенияОРасширении(Расширение)

	Сведения = Новый Структура;
	Сведения.Вставить("Имя", Расширение.Имя);
	Сведения.Вставить("Версия", Строка(Расширение.Версия));
	Сведения.Вставить("Неоднозначное", Ложь);

	Возврат Сведения;

КонецФункции

#КонецОбласти

#КонецЕсли
